
class Iran{
  Map<String, List<String>> neighbors = {
    'آذربایجان شرقی': ['آذربایجان غربی', 'اردبیل', 'زنجان'],
    'آذربایجان غربی': ['آذربایجان شرقی', 'کردستان', 'زنجان'],
    'اردبیل': ['آذربایجان شرقی', 'زنجان', 'گیلان'],
    'اصفهان': ['فارس', 'چهارمحال و بختیاری', 'یزد', 'لرستان', 'اراک', 'سمنان', 'خراسان جنوبی', 'کهگیلویه و بویراحمد', 'قم'],
    'البرز': ['تهران', 'قزوین', 'مازندران', 'اراک'],
    'ایلام': ['خوزستان', 'لرستان', 'کرمانشاه'],
    'بوشهر': ['خوزستان', 'فارس', 'هرمزگان', 'کهگیلویه و بویراحمد'],
    'تهران': ['البرز', 'مازندران', 'اراک', 'سمنان', 'قم'],
    'چهارمحال و بختیاری': ['اصفهان', 'خوزستان', 'لرستان', 'کهگیلویه و بویراحمد'],
    'خراسان جنوبی': ['سیستان و بلوچستان', 'یزد', 'خراسان رضوی', 'سمنان', 'اصفهان', 'کرمان'],
    'خراسان رضوی': ['خراسان شمالی', 'خراسان جنوبی', 'سمنان'],
    'خراسان شمالی': ['خراسان رضوی', 'گلستان', 'سمنان'],
    'خوزستان': ['ایلام', 'لرستان', 'چهارمحال و بختیاری', 'بوشهر', 'کهگیلویه و بویراحمد'],
    'زنجان': ['آذربایجان شرقی', 'آذربایجان غربی', 'اردبیل', 'قزوین', 'گیلان', 'همدان', 'کردستان'],
    'سمنان': ['تهران', 'گلستان', 'اصفهان', 'قم', 'مازندران', 'خراسان شمالی', 'خراسان رضوی', 'خراسان جنوبی'],
    'سیستان و بلوچستان': ['خراسان جنوبی', 'هرمزگان',  'کرمان'],
    'فارس': ['اصفهان', 'کرمان', 'بوشهر', 'کهگیلویه و بویراحمد', 'یزد', 'هرمزگان'],
    'قزوین': ['البرز', 'زنجان', 'اراک', 'همدان', 'مازندران', 'گیلان'],
    'قم': ['تهران', 'اراک', 'اصفهان', 'سمنان'],
    'کردستان': ['آذربایجان غربی', 'زنجان', 'کرمانشاه', 'همدان'],
    'کرمان': ['یزد', 'فارس', 'هرمزگان', 'سیستان و بلوچستان', 'خراسان جنوبی'],
    'کرمانشاه': ['ایلام', 'کردستان', 'همدان', 'لرستان'],
    'کهگیلویه و بویراحمد': ['فارس', 'اصفهان', 'خوزستان', 'چهارمحال و بختیاری', 'بوشهر'],
    'گلستان': ['خراسان شمالی', 'سمنان', 'مازندران'],
    'گیلان': ['اردبیل', 'زنجان', 'مازندران', 'قزوین'],
    'لرستان': ['ایلام', 'خوزستان', 'چهارمحال و بختیاری', 'اصفهان', 'همدان', 'اراک', 'کرمانشاه'],
    'مازندران': ['گلستان', 'گیلان', 'البرز', 'سمنان', 'تهران', 'قزوین'],
    'اراک': ['اصفهان', 'قزوین', 'همدان', 'تهران', 'قم', 'البرز', 'لرستان'],
    'هرمزگان': ['بوشهر', 'فارس', 'سیستان و بلوچستان', 'کرمان'],
    'همدان': ['کردستان', 'لرستان', 'اراک', 'زنجان', 'کرمانشاه', 'قزوین'],
    'یزد': ['فارس', 'اصفهان', 'خراسان جنوبی', 'کرمان']
  };
}

class Khorasan{



  Map<String, List<String>> cityNeighbors = {
    'بیرجند': ['قائن', 'خوسف', 'درمیان', 'سربیشه' , 'زیرکوه', 'سرایان', ],
    'قائن': ['بیرجند', 'زیرکوه', 'سرایان'],
    'نهبندان': ['سربیشه', 'خوسف'],
    'سربیشه': ['بیرجند', 'خوسف', 'درمیان', 'نهبندان',],
    'درمیان': ['سربیشه', 'زیرکوه','بیرجند',],
    'زیرکوه': ['قائن', 'درمیان','بیرجند',],
    'خوسف': ['بیرجند', 'سربیشه', 'طبس', 'سرایان', 'نهبندان',],
    'فردوس': ['بشرویه', 'سرایان', 'طبس'],
    'سرایان': ['قائن', 'فردوس','طبس', 'خوسف','بیرجند',],
    'طبس': [ 'خوسف', 'سرایان','فردوس','بشرویه'],
    'بشرویه': ['فردوس', 'طبس'],
  };

}

class Graph2 {
  Map<String, List<String>> adjacencyList = {};
  Map<String, List<String>> damane = {};
  // اضافه کردن راس به گراف
  void addVertex(String ostan) {
    adjacencyList[ostan] = [];
    damane[ostan] =["blue","green","red","white"];
  }

  // اضافه کردن یال بین دو راس
  void addEdge(String ostan1, String ostan2) {
    adjacencyList[ostan1]?.add(ostan2);

  }




  List<String> getVertices() {
    return adjacencyList.keys.toList();
  }

  List<String> getDamane(String ostan) {
    return damane[ostan] ?? [];
  }

  void removeDamane(String ostan,String color) {
     damane[ostan]?.remove(color) ;
  }
  List<String> getNeighbors(String ostan) {
    return adjacencyList[ostan] ?? [];
  }

  // نمایش گراف
  void display() {
    adjacencyList.forEach((ostan, edges) {
      print('$ostan: ${edges.join(', ')}');
    });
  }




}



